jyyy3901/GD32_HAL_Compat/Tests/test_uart_host.c
#include "stm32f4xx_hal.h"
#include <assert.h>
#include <stdio.h>
#include <string.h>

static GD32_HAL_UARTConfig mock_config;
static uint32_t mock_configure_count;
static uint32_t mock_deinit_count;
static uint32_t mock_flags;
static uint32_t mock_error_flags;
static uint32_t mock_interrupts;
static uint16_t mock_tx_data[32];
static uint32_t mock_tx_count;
static uint16_t mock_rx_data[32];
static uint32_t mock_rx_count;
static uint32_t mock_rx_position;
static uint32_t mock_clear_error_count;
static int mock_dma_tx_active;
static int mock_dma_rx_active;
static uint32_t mock_tick;
static int mock_tick_auto_increment;
static GD32_HAL_PortError mock_last_port_error;
static uint32_t mock_msp_init_count;
static uint32_t mock_msp_deinit_count;
static uint32_t mock_tx_callback_count;
static uint32_t mock_tx_half_callback_count;
static uint32_t mock_rx_callback_count;
static uint32_t mock_rx_half_callback_count;
static uint32_t mock_error_callback_count;
static uint32_t mock_error_callback_last_code;
static uint32_t mock_abort_callback_count;
static uint32_t mock_abort_tx_callback_count;
static uint32_t mock_abort_rx_callback_count;
static uint8_t mock_callback_events[16];
static uint32_t mock_callback_event_count;
static uint32_t mock_dma_start_count;
static uint32_t mock_dma_abort_count;
static uint32_t mock_dma_source;
static uint32_t mock_dma_destination;
static uint32_t mock_dma_length;

#define MOCK_EVENT_TX    1U
#define MOCK_EVENT_RX    2U
#define MOCK_EVENT_ERROR 3U
#define MOCK_EVENT_ABORT 4U

static void mock_reset(void)
{
    memset(&mock_config, 0, sizeof(mock_config));
    mock_configure_count = 0U;
    mock_deinit_count = 0U;
    mock_flags = GD32_HAL_UART_FLAG_TX_EMPTY |
                 GD32_HAL_UART_FLAG_TX_COMPLETE;
    mock_error_flags = 0U;
    mock_interrupts = 0U;
    mock_tx_count = 0U;
    mock_rx_count = 0U;
    mock_rx_position = 0U;
    mock_clear_error_count = 0U;
    mock_dma_tx_active = 0;
    mock_dma_rx_active = 0;
    mock_tick = 0U;
    mock_tick_auto_increment = 0;
    mock_last_port_error = GD32_HAL_PORT_ERROR_NONE;
    mock_msp_init_count = 0U;
    mock_msp_deinit_count = 0U;
    mock_tx_callback_count = 0U;
    mock_tx_half_callback_count = 0U;
    mock_rx_callback_count = 0U;
    mock_rx_half_callback_count = 0U;
    mock_error_callback_count = 0U;
    mock_error_callback_last_code = HAL_UART_ERROR_NONE;
    mock_abort_callback_count = 0U;
    mock_abort_tx_callback_count = 0U;
    mock_abort_rx_callback_count = 0U;
    mock_callback_event_count = 0U;
    mock_dma_start_count = 0U;
    mock_dma_abort_count = 0U;
    mock_dma_source = 0U;
    mock_dma_destination = 0U;
    mock_dma_length = 0U;
}

static void mock_feed_rx(const uint16_t *data, uint32_t count)
{
    uint32_t index;

    assert(count <= (sizeof(mock_rx_data) / sizeof(mock_rx_data[0])));
    for (index = 0U; index < count; ++index)
    {
        mock_rx_data[index] = data[index];
    }
    mock_rx_count = count;
    mock_rx_position = 0U;
}

static UART_HandleTypeDef mock_handle(USART_TypeDef *instance)
{
    UART_HandleTypeDef huart;

    memset(&huart, 0, sizeof(huart));
    huart.Instance = instance;
    huart.Init.BaudRate = 115200U;
    huart.Init.WordLength = UART_WORDLENGTH_8B;
    huart.Init.StopBits = UART_STOPBITS_1;
    huart.Init.Parity = UART_PARITY_NONE;
    huart.Init.Mode = UART_MODE_TX_RX;
    huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart.Init.OverSampling = UART_OVERSAMPLING_16;
    huart.gState = HAL_UART_STATE_RESET;
    huart.RxState = HAL_UART_STATE_RESET;
    return huart;
}

static DMA_HandleTypeDef mock_dma_handle(DMA_Stream_TypeDef *instance,
                                         uint32_t request,
                                         uint32_t direction,
                                         uint32_t mode)
{
    DMA_HandleTypeDef hdma;

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = instance;
    hdma.Init.Channel = request;
    hdma.Init.Direction = direction;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma.Init.Mode = mode;
    hdma.Init.Priority = DMA_PRIORITY_LOW;
    hdma.State = HAL_DMA_STATE_READY;
    return hdma;
}

uint32_t HAL_GetTick(void)
{
    uint32_t value = mock_tick;
    if (mock_tick_auto_increment != 0)
    {
        ++mock_tick;
    }
    return value;
}

void GD32_HAL_ErrorHook(GD32_HAL_PortError error, uint32_t detail)
{
    (void)detail;
    mock_last_port_error = error;
}

void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_msp_init_count;
}

void HAL_UART_MspDeInit(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_msp_deinit_count;
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_tx_callback_count;
    mock_callback_events[mock_callback_event_count++] = MOCK_EVENT_TX;
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_tx_half_callback_count;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_rx_callback_count;
    mock_callback_events[mock_callback_event_count++] = MOCK_EVENT_RX;
}

void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_rx_half_callback_count;
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    ++mock_error_callback_count;
    mock_error_callback_last_code = huart->ErrorCode;
    mock_callback_events[mock_callback_event_count++] = MOCK_EVENT_ERROR;
}

void HAL_UART_AbortCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_abort_callback_count;
    mock_callback_events[mock_callback_event_count++] = MOCK_EVENT_ABORT;
}

void HAL_UART_AbortTransmitCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_abort_tx_callback_count;
}

void HAL_UART_AbortReceiveCpltCallback(UART_HandleTypeDef *huart)
{
    (void)huart;
    ++mock_abort_rx_callback_count;
}

