jyyy3901/GD32_HAL_Compat/Tests/test_uart_host.c
int GD32_HAL_UART_IsInstance(uint32_t uart_address)
{
    return (uart_address == GD32_HAL_USART0_ADDRESS) ||
           (uart_address == GD32_HAL_USART1_ADDRESS) ||
           (uart_address == GD32_HAL_USART2_ADDRESS) ||
           (uart_address == GD32_HAL_UART3_ADDRESS) ||
           (uart_address == GD32_HAL_UART4_ADDRESS);
}

int GD32_HAL_UART_IsFlowControlCapable(uint32_t uart_address)
{
    return (uart_address == GD32_HAL_USART0_ADDRESS) ||
           (uart_address == GD32_HAL_USART1_ADDRESS) ||
           (uart_address == GD32_HAL_USART2_ADDRESS);
}

int GD32_HAL_UART_IsDMACapable(uint32_t uart_address)
{
    return (uart_address == GD32_HAL_USART0_ADDRESS) ||
           (uart_address == GD32_HAL_USART1_ADDRESS) ||
           (uart_address == GD32_HAL_USART2_ADDRESS) ||
           (uart_address == GD32_HAL_UART3_ADDRESS);
}

int GD32_HAL_UART_IsDMAChannelValid(uint32_t uart_address,
                                    int transmit,
                                    uint32_t channel_address,
                                    uint32_t request)
{
    if (uart_address == GD32_HAL_USART0_ADDRESS)
    {
        return (transmit != 0) ?
               ((channel_address == GD32_HAL_DMA0_CHANNEL3_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART0_TX)) :
               ((channel_address == GD32_HAL_DMA0_CHANNEL4_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART0_RX));
    }
    if (uart_address == GD32_HAL_USART1_ADDRESS)
    {
        return (transmit != 0) ?
               ((channel_address == GD32_HAL_DMA0_CHANNEL6_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART1_TX)) :
               ((channel_address == GD32_HAL_DMA0_CHANNEL5_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART1_RX));
    }
    if (uart_address == GD32_HAL_USART2_ADDRESS)
    {
        return (transmit != 0) ?
               ((channel_address == GD32_HAL_DMA0_CHANNEL1_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART2_TX)) :
               ((channel_address == GD32_HAL_DMA0_CHANNEL2_ADDRESS) &&
                (request == GD32_DMA_REQUEST_USART2_RX));
    }
    if (uart_address == GD32_HAL_UART3_ADDRESS)
    {
        return (transmit != 0) ?
               ((channel_address == GD32_HAL_DMA1_CHANNEL4_ADDRESS) &&
                (request == GD32_DMA_REQUEST_UART3_TX)) :
               ((channel_address == GD32_HAL_DMA1_CHANNEL2_ADDRESS) &&
                (request == GD32_DMA_REQUEST_UART3_RX));
    }
    return 0;
}

uint32_t GD32_HAL_UART_GetDataAddress(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    return uart_address + 0x04U;
}

int GD32_HAL_UART_IsDMARequestActive(uint32_t uart_address, int transmit)
{
    (void)uart_address;
    return (transmit != 0) ? mock_dma_tx_active : mock_dma_rx_active;
}

void GD32_HAL_UART_EnableDMARequest(uint32_t uart_address, int transmit)
{
    assert(GD32_HAL_UART_IsDMACapable(uart_address));
    if (transmit != 0)
    {
        mock_dma_tx_active = 1;
    }
    else
    {
        mock_dma_rx_active = 1;
    }
}

int GD32_HAL_UART_Configure(uint32_t uart_address, const GD32_HAL_UARTConfig *config)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    mock_config = *config;
    ++mock_configure_count;
    return 0;
}

void GD32_HAL_UART_DeInit(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    ++mock_deinit_count;
}

void GD32_HAL_UART_Enable(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
}

void GD32_HAL_UART_Disable(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
}

uint32_t GD32_HAL_UART_GetFlag(uint32_t uart_address, GD32_HAL_UARTFlag flag)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    if ((flag == GD32_HAL_UART_FLAG_RX_NOT_EMPTY) &&
        (mock_rx_position < mock_rx_count))
    {
        return (uint32_t)flag;
    }
    return mock_flags & (uint32_t)flag;
}

void GD32_HAL_UART_ClearFlag(uint32_t uart_address, GD32_HAL_UARTFlag flag)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    mock_flags &= ~(uint32_t)flag;
}

uint32_t GD32_HAL_UART_GetErrorFlags(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    return mock_error_flags;
}

void GD32_HAL_UART_ClearErrors(uint32_t uart_address)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    mock_error_flags = 0U;
    ++mock_clear_error_count;
}

void GD32_HAL_UART_WriteData(uint32_t uart_address, uint16_t data)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    assert(mock_tx_count < (sizeof(mock_tx_data) / sizeof(mock_tx_data[0])));
    mock_tx_data[mock_tx_count++] = data;
}

uint16_t GD32_HAL_UART_ReadData(uint32_t uart_address)
{
    uint16_t data;

    assert(GD32_HAL_UART_IsInstance(uart_address));
    assert(mock_rx_position < mock_rx_count);
    data = mock_rx_data[mock_rx_position++];
    mock_error_flags = 0U;
    return data;
}

void GD32_HAL_UART_SetInterrupt(uint32_t uart_address,
                               GD32_HAL_UARTInterrupt interrupt,
                               int enable)
{
    const uint32_t mask = 1UL << (uint32_t)interrupt;
    assert(GD32_HAL_UART_IsInstance(uart_address));
    if (enable != 0)
    {
        mock_interrupts |= mask;
    }
    else
    {
        mock_interrupts &= ~mask;
    }
}

int GD32_HAL_UART_IsInterruptEnabled(uint32_t uart_address,
                                    GD32_HAL_UARTInterrupt interrupt)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    return (mock_interrupts & (1UL << (uint32_t)interrupt)) != 0U;
}

void GD32_HAL_UART_DisableDMARequest(uint32_t uart_address, int transmit)
{
    assert(GD32_HAL_UART_IsInstance(uart_address));
    if (transmit != 0)
    {
        mock_dma_tx_active = 0;
    }
    else
    {
        mock_dma_rx_active = 0;
    }
}

HAL_StatusTypeDef HAL_DMA_Start_IT(DMA_HandleTypeDef *hdma,
                                   uint32_t SrcAddress,
                                   uint32_t DstAddress,
                                   uint32_t DataLength)
{
    if ((hdma == NULL) || (hdma->State != HAL_DMA_STATE_READY))
    {
        return (hdma == NULL) ? HAL_ERROR : HAL_BUSY;
    }
    hdma->State = HAL_DMA_STATE_BUSY;
    mock_dma_source = SrcAddress;
    mock_dma_destination = DstAddress;
    mock_dma_length = DataLength;
    ++mock_dma_start_count;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
    if ((hdma == NULL) || (hdma->State != HAL_DMA_STATE_BUSY))
    {
        return HAL_ERROR;
    }
    hdma->State = HAL_DMA_STATE_READY;
    ++mock_dma_abort_count;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
{
    void (*callback)(DMA_HandleTypeDef *hdma);

    if ((hdma == NULL) || (hdma->State != HAL_DMA_STATE_BUSY))
    {
        return HAL_ERROR;
    }
    callback = hdma->XferAbortCallback;
    hdma->State = HAL_DMA_STATE_READY;
    ++mock_dma_abort_count;
    if (callback != NULL)
    {
        callback(hdma);
    }
    return HAL_OK;
}

HAL_DMA_StateTypeDef HAL_DMA_GetState(const DMA_HandleTypeDef *hdma)
{
    return (hdma == NULL) ? HAL_DMA_STATE_RESET : hdma->State;
}

