jyyy3901/GD32_HAL_Compat/Tests/test_uart_host.c
static void test_init_and_guards(void)
{
    UART_HandleTypeDef huart;

    mock_reset();
    assert((int)USART1_IRQn == GD32_HAL_USART0_IRQn_VALUE);
    assert((int)USART2_IRQn == GD32_HAL_USART1_IRQn_VALUE);
    assert((int)USART3_IRQn == GD32_HAL_USART2_IRQn_VALUE);
    assert((int)UART4_IRQn == GD32_HAL_UART3_IRQn_VALUE);
    assert((int)UART5_IRQn == GD32_HAL_UART4_IRQn_VALUE);
    assert((uint32_t)(uintptr_t)USART1 == GD32_HAL_USART0_ADDRESS);
    assert((uint32_t)(uintptr_t)UART5 == GD32_HAL_UART4_ADDRESS);

    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    assert(mock_configure_count == 1U);
    assert(mock_config.baud_rate == 115200U);
    assert(mock_config.word_length == 8U);
    assert(mock_config.mode == (GD32_HAL_UART_MODE_TX | GD32_HAL_UART_MODE_RX));
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(mock_msp_init_count == 1U);

    huart.Init.OverSampling = UART_OVERSAMPLING_8;
    assert(HAL_UART_Init(&huart) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_OVERSAMPLING_UNSUPPORTED);

    huart = mock_handle(UART4);
    huart.Init.HwFlowCtl = UART_HWCONTROL_RTS;
    assert(HAL_UART_Init(&huart) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_FLOW_CONTROL_UNSUPPORTED);
}

static void test_polling(void)
{
    UART_HandleTypeDef huart;
    const uint8_t tx[] = {0x12U, 0x34U, 0x56U};
    const uint16_t rx_source[] = {0xA1U, 0xB2U, 0xC3U};
    uint8_t rx[3] = {0U};

    mock_reset();
    huart = mock_handle(USART2);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    huart.pRxBuffPtr = (uint8_t *)(uintptr_t)0x1234U;
    assert(HAL_UART_Transmit(&huart, tx, 0U, 10U) == HAL_ERROR);
    assert(HAL_UART_Transmit(&huart, tx, 3U, 10U) == HAL_OK);
    assert(mock_tx_count == 3U);
    assert(mock_tx_data[0] == 0x12U);
    assert(mock_tx_data[2] == 0x56U);
    assert(huart.gState == HAL_UART_STATE_READY);

    mock_feed_rx(rx_source, 3U);
    assert(HAL_UART_Receive(&huart, rx, 3U, 10U) == HAL_OK);
    assert(rx[0] == 0xA1U);
    assert(rx[1] == 0xB2U);
    assert(rx[2] == 0xC3U);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(huart.pRxBuffPtr == (uint8_t *)(uintptr_t)0x1234U);

    mock_flags = GD32_HAL_UART_FLAG_TX_COMPLETE;
    mock_tick_auto_increment = 1;
    assert(HAL_UART_Transmit(&huart, tx, 1U, 2U) == HAL_TIMEOUT);
    assert(huart.gState == HAL_UART_STATE_READY);

    mock_flags = GD32_HAL_UART_FLAG_TX_EMPTY |
                 GD32_HAL_UART_FLAG_TX_COMPLETE;
    mock_tick_auto_increment = 0;
    mock_feed_rx(rx_source, 1U);
    mock_error_flags = GD32_HAL_UART_ERROR_FE;
    assert(HAL_UART_Receive(&huart, rx, 1U, 10U) == HAL_ERROR);
    assert((huart.ErrorCode & HAL_UART_ERROR_FE) != 0U);
    assert(huart.RxState == HAL_UART_STATE_READY);
}

static void test_nine_bit_data_path(void)
{
    UART_HandleTypeDef huart;
    const uint16_t tx[] = {0x01A5U, 0x005AU};
    const uint16_t rx_source[] = {0x0101U, 0x00FEU};
    uint16_t rx[2] = {0U};

    mock_reset();
    huart = mock_handle(USART1);
    huart.Init.WordLength = UART_WORDLENGTH_9B;
    assert(HAL_UART_Init(&huart) == HAL_OK);
    assert(HAL_UART_Transmit(&huart,
                             (const uint8_t *)(const void *)tx,
                             2U,
                             10U) == HAL_OK);
    assert(mock_tx_data[0] == 0x01A5U);
    assert(mock_tx_data[1] == 0x005AU);

    mock_feed_rx(rx_source, 2U);
    assert(HAL_UART_Receive(&huart, (uint8_t *)(void *)rx, 2U, 10U) == HAL_OK);
    assert(rx[0] == 0x0101U);
    assert(rx[1] == 0x00FEU);
}

static void test_parity_data_mask(void)
{
    UART_HandleTypeDef huart;
    const uint16_t rx_source[] = {0x00FFU};
    uint8_t rx = 0U;

    mock_reset();
    huart = mock_handle(USART1);
    huart.Init.Parity = UART_PARITY_EVEN;
    assert(HAL_UART_Init(&huart) == HAL_OK);
    mock_feed_rx(rx_source, 1U);
    assert(HAL_UART_Receive(&huart, &rx, 1U, 10U) == HAL_OK);
    assert(rx == 0x7FU);
}

static void test_interrupt_transfers(void)
{
    UART_HandleTypeDef huart;
    const uint8_t tx[] = {0x41U, 0x42U};
    const uint16_t rx_source[] = {0x61U, 0x62U};
    uint8_t rx[2] = {0U};

    mock_reset();
    huart = mock_handle(USART3);
    assert(HAL_UART_Init(&huart) == HAL_OK);

    assert(HAL_UART_Transmit_IT(&huart, tx, 2U) == HAL_OK);
    assert(HAL_UART_Transmit_IT(&huart, tx, 1U) == HAL_BUSY);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TXE));
    HAL_UART_IRQHandler(&huart);
    assert(huart.TxXferCount == 1U);
    HAL_UART_IRQHandler(&huart);
    assert(huart.TxXferCount == 0U);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TXE));
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TC));
    HAL_UART_IRQHandler(&huart);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TC));
    assert(mock_tx_count == 2U);
    assert(mock_tx_callback_count == 1U);

    mock_feed_rx(rx_source, 2U);
    assert(HAL_UART_Receive_IT(&huart, rx, 2U) == HAL_OK);
    assert(HAL_UART_Receive_IT(&huart, rx, 1U) == HAL_BUSY);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_RXNE));
    HAL_UART_IRQHandler(&huart);
    HAL_UART_IRQHandler(&huart);
    assert(rx[0] == 0x61U);
    assert(rx[1] == 0x62U);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_RXNE));
    assert(mock_rx_callback_count == 1U);
}

static void test_interrupt_full_duplex(void)
{
    UART_HandleTypeDef huart;
    const uint8_t tx = 0x35U;
    const uint16_t rx_source[] = {0x53U};
    uint8_t rx = 0U;

    mock_reset();
    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    mock_feed_rx(rx_source, 1U);

    assert(HAL_UART_Transmit_IT(&huart, &tx, 1U) == HAL_OK);
    assert(HAL_UART_Receive_IT(&huart, &rx, 1U) == HAL_OK);
    assert(huart.gState == HAL_UART_STATE_BUSY_TX);
    assert(huart.RxState == HAL_UART_STATE_BUSY_RX);

