jyyy3901/GD32_HAL_Compat/Tests/test_uart_host.c
    HAL_UART_IRQHandler(&huart);
    assert(rx == 0x53U);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(huart.gState == HAL_UART_STATE_BUSY_TX);

    HAL_UART_IRQHandler(&huart);
    HAL_UART_IRQHandler(&huart);
    assert(mock_tx_data[0] == 0x35U);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(mock_tx_callback_count == 1U);
    assert(mock_rx_callback_count == 1U);
}

static void test_interrupt_error_mapping(void)
{
    static const uint32_t port_errors[] = {
        GD32_HAL_UART_ERROR_PE,
        GD32_HAL_UART_ERROR_NE,
        GD32_HAL_UART_ERROR_FE
    };
    static const uint32_t hal_errors[] = {
        HAL_UART_ERROR_PE,
        HAL_UART_ERROR_NE,
        HAL_UART_ERROR_FE
    };
    UART_HandleTypeDef huart;
    uint8_t rx[2] = {0U};
    uint32_t index;

    mock_reset();
    huart = mock_handle(USART2);
    huart.Init.Parity = UART_PARITY_EVEN;
    assert(HAL_UART_Init(&huart) == HAL_OK);
    assert(HAL_UART_Receive_IT(&huart, rx, 2U) == HAL_OK);

    for (index = 0U; index < 3U; ++index)
    {
        mock_error_flags = port_errors[index];
        HAL_UART_IRQHandler(&huart);
        assert(mock_error_callback_last_code == hal_errors[index]);
        assert(huart.ErrorCode == HAL_UART_ERROR_NONE);
        assert(huart.RxState == HAL_UART_STATE_BUSY_RX);
    }

    assert(HAL_UART_AbortReceive(&huart) == HAL_OK);
}

static void test_interrupt_errors_and_abort(void)
{
    UART_HandleTypeDef huart;
    uint8_t rx[2] = {0U};

    mock_reset();
    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    {
        const uint16_t error_data[] = {0x55U};
        mock_feed_rx(error_data, 1U);
    }
    assert(HAL_UART_Receive_IT(&huart, rx, 1U) == HAL_OK);
    mock_callback_event_count = 0U;
    mock_error_flags = GD32_HAL_UART_ERROR_FE;
    HAL_UART_IRQHandler(&huart);
    assert(mock_callback_event_count == 2U);
    assert(mock_callback_events[0] == MOCK_EVENT_RX);
    assert(mock_callback_events[1] == MOCK_EVENT_ERROR);
    assert(mock_rx_callback_count == 1U);
    assert(mock_error_callback_count == 1U);
    assert(mock_error_callback_last_code == HAL_UART_ERROR_FE);
    assert(huart.ErrorCode == HAL_UART_ERROR_NONE);
    assert(huart.RxState == HAL_UART_STATE_READY);

    assert(HAL_UART_Receive_IT(&huart, rx, 2U) == HAL_OK);
    mock_error_flags = GD32_HAL_UART_ERROR_ORE;
    HAL_UART_IRQHandler(&huart);
    assert(mock_clear_error_count == 1U);
    assert(mock_error_callback_count == 2U);
    assert((huart.ErrorCode & HAL_UART_ERROR_ORE) != 0U);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_RXNE));

    huart.gState = HAL_UART_STATE_BUSY_TX;
    huart.TxXferCount = 5U;
    assert(HAL_UART_AbortTransmit_IT(&huart) == HAL_OK);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(huart.TxXferCount == 0U);
    assert(mock_abort_tx_callback_count == 1U);

    huart.gState = HAL_UART_STATE_BUSY_TX;
    huart.TxXferCount = 4U;
    mock_dma_tx_active = 1;
    assert(HAL_UART_AbortTransmit(&huart) == HAL_ERROR);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert((huart.ErrorCode & HAL_UART_ERROR_DMA) != 0U);
    assert(mock_dma_tx_active == 0);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_DMA_LINK_INVALID);
}

static void test_dma_normal_transfers(void)
{
    UART_HandleTypeDef huart;
    DMA_HandleTypeDef hdmatx;
    DMA_HandleTypeDef hdmarx;
    const uint8_t tx[] = {0x11U, 0x22U, 0x33U, 0x44U};
    uint8_t rx[4] = {0U};

    mock_reset();
    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL3,
                             GD32_DMA_REQUEST_USART0_TX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_NORMAL);
    hdmarx = mock_dma_handle(GD32_DMA0_CHANNEL4,
                             GD32_DMA_REQUEST_USART0_RX,
                             DMA_PERIPH_TO_MEMORY,
                             DMA_NORMAL);
    __HAL_LINKDMA(&huart, hdmatx, hdmatx);
    __HAL_LINKDMA(&huart, hdmarx, hdmarx);

    assert(HAL_UART_Transmit_DMA(&huart, tx, 4U) == HAL_OK);
    assert(HAL_UART_Transmit_DMA(&huart, tx, 4U) == HAL_BUSY);
    assert(mock_dma_start_count == 1U);
    assert(mock_dma_source == (uint32_t)(uintptr_t)tx);
    assert(mock_dma_destination == GD32_HAL_USART0_ADDRESS + 0x04U);
    assert(mock_dma_length == 4U);
    assert(mock_dma_tx_active != 0);
    assert(huart.gState == HAL_UART_STATE_BUSY_TX);

    hdmatx.XferHalfCpltCallback(&hdmatx);
    assert(mock_tx_half_callback_count == 1U);
    hdmatx.State = HAL_DMA_STATE_READY;
    hdmatx.XferCpltCallback(&hdmatx);
    assert(mock_dma_tx_active == 0);
    assert(huart.TxXferCount == 0U);
    assert(huart.gState == HAL_UART_STATE_BUSY_TX);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TC));
    assert(mock_tx_callback_count == 0U);
    mock_flags |= GD32_HAL_UART_FLAG_TX_COMPLETE;
    HAL_UART_IRQHandler(&huart);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(mock_tx_callback_count == 1U);

    hdmatx.State = HAL_DMA_STATE_READY;
    assert(HAL_UART_Transmit_DMA(&huart, tx, 4U) == HAL_OK);
    hdmatx.State = HAL_DMA_STATE_READY;
    hdmatx.XferCpltCallback(&hdmatx);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TC));
    assert(HAL_UART_DMAStop(&huart) == HAL_OK);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_TC));
    assert(mock_tx_callback_count == 1U);

    assert(HAL_UART_Receive_DMA(&huart, rx, 4U) == HAL_OK);
    assert(HAL_UART_Receive_DMA(&huart, rx, 4U) == HAL_BUSY);
    assert(mock_dma_start_count == 3U);
    assert(mock_dma_source == GD32_HAL_USART0_ADDRESS + 0x04U);
    assert(mock_dma_destination == (uint32_t)(uintptr_t)rx);
    assert(mock_dma_rx_active != 0);
    assert(huart.RxState == HAL_UART_STATE_BUSY_RX);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_ERR));

    hdmarx.XferHalfCpltCallback(&hdmarx);
    assert(mock_rx_half_callback_count == 1U);
    assert(huart.RxEventType == HAL_UART_RXEVENT_HT);
    hdmarx.State = HAL_DMA_STATE_READY;
    hdmarx.XferCpltCallback(&hdmarx);
    assert(mock_dma_rx_active == 0);
    assert(huart.RxXferCount == 0U);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(huart.RxEventType == HAL_UART_RXEVENT_TC);
    assert(mock_rx_callback_count == 1U);
}

static void test_dma_circular_pause_resume_stop(void)
{
    UART_HandleTypeDef huart;
    DMA_HandleTypeDef hdmatx;
    DMA_HandleTypeDef hdmarx;
    uint8_t tx[8] = {0U};
    uint8_t rx[8] = {0U};

    mock_reset();
    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL3,
                             GD32_DMA_REQUEST_USART0_TX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_CIRCULAR);
    hdmarx = mock_dma_handle(GD32_DMA0_CHANNEL4,
                             GD32_DMA_REQUEST_USART0_RX,
                             DMA_PERIPH_TO_MEMORY,
                             DMA_CIRCULAR);
    __HAL_LINKDMA(&huart, hdmatx, hdmatx);
    __HAL_LINKDMA(&huart, hdmarx, hdmarx);

    assert(HAL_UART_Transmit_DMA(&huart, tx, 8U) == HAL_OK);
    assert(HAL_UART_Receive_DMA(&huart, rx, 8U) == HAL_OK);
    hdmatx.XferCpltCallback(&hdmatx);
    hdmarx.XferCpltCallback(&hdmarx);
    assert(mock_tx_callback_count == 1U);
    assert(mock_rx_callback_count == 1U);
    assert(huart.gState == HAL_UART_STATE_BUSY_TX);
    assert(huart.RxState == HAL_UART_STATE_BUSY_RX);
    assert(mock_dma_tx_active != 0);
    assert(mock_dma_rx_active != 0);

    assert(HAL_UART_DMAPause(&huart) == HAL_OK);
    assert(mock_dma_tx_active == 0);
    assert(mock_dma_rx_active == 0);
    assert(!__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_ERR));
    assert(HAL_UART_DMAResume(&huart) == HAL_OK);
    assert(mock_dma_tx_active != 0);
    assert(mock_dma_rx_active != 0);
    assert(__HAL_UART_GET_IT_SOURCE(&huart, UART_IT_ERR));

    assert(HAL_UART_DMAPause(&huart) == HAL_OK);
    assert(HAL_UART_DMAStop(&huart) == HAL_OK);
    assert(mock_dma_abort_count == 2U);
    assert(hdmatx.State == HAL_DMA_STATE_READY);
    assert(hdmarx.State == HAL_DMA_STATE_READY);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(huart.RxState == HAL_UART_STATE_READY);

    assert(HAL_UART_Transmit_DMA(&huart, tx, 8U) == HAL_OK);
    assert(HAL_UART_Receive_DMA(&huart, rx, 8U) == HAL_OK);
    assert(HAL_UART_DMAPause(&huart) == HAL_OK);
    assert(HAL_UART_Abort_IT(&huart) == HAL_OK);
    assert(mock_dma_abort_count == 4U);
    assert(mock_abort_callback_count == 1U);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(huart.RxState == HAL_UART_STATE_READY);

    assert(HAL_UART_Transmit_DMA(&huart, tx, 8U) == HAL_OK);
    assert(HAL_UART_Receive_DMA(&huart, rx, 8U) == HAL_OK);
    hdmarx.State = HAL_DMA_STATE_READY;
    hdmarx.XferErrorCallback(&hdmarx);
    assert(mock_dma_abort_count == 5U);
    assert(hdmatx.State == HAL_DMA_STATE_READY);
    assert(mock_dma_tx_active == 0);
    assert(mock_dma_rx_active == 0);
    assert(huart.gState == HAL_UART_STATE_READY);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert((huart.ErrorCode & HAL_UART_ERROR_DMA) != 0U);
}

static void test_dma_errors_abort_and_guards(void)
{
    UART_HandleTypeDef huart;
    DMA_HandleTypeDef hdmatx;
    DMA_HandleTypeDef hdmarx;
    uint8_t data[4] = {0U};

    mock_reset();
    huart = mock_handle(USART2);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL6,
                             GD32_DMA_REQUEST_USART1_TX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_NORMAL);
    hdmarx = mock_dma_handle(GD32_DMA0_CHANNEL5,
                             GD32_DMA_REQUEST_USART1_RX,
                             DMA_PERIPH_TO_MEMORY,
                             DMA_NORMAL);
    __HAL_LINKDMA(&huart, hdmatx, hdmatx);
    __HAL_LINKDMA(&huart, hdmarx, hdmarx);

    assert(HAL_UART_Receive_DMA(&huart, data, 4U) == HAL_OK);
    mock_error_flags = GD32_HAL_UART_ERROR_FE;
    HAL_UART_IRQHandler(&huart);
    assert(mock_dma_abort_count == 1U);
    assert(mock_dma_rx_active == 0);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert(mock_error_callback_count == 1U);
    assert((mock_error_callback_last_code & HAL_UART_ERROR_FE) != 0U);

    hdmarx.State = HAL_DMA_STATE_READY;
    assert(HAL_UART_Receive_DMA(&huart, data, 4U) == HAL_OK);
    hdmarx.State = HAL_DMA_STATE_ERROR;
    hdmarx.XferErrorCallback(&hdmarx);
    assert(mock_dma_rx_active == 0);
    assert(huart.RxState == HAL_UART_STATE_READY);
    assert((huart.ErrorCode & HAL_UART_ERROR_DMA) != 0U);
    assert(mock_error_callback_count == 2U);

    huart.ErrorCode = HAL_UART_ERROR_NONE;
    hdmatx.State = HAL_DMA_STATE_READY;
    assert(HAL_UART_Transmit_DMA(&huart, data, 4U) == HAL_OK);
    assert(HAL_UART_AbortTransmit_IT(&huart) == HAL_OK);
    assert(mock_abort_tx_callback_count == 1U);
    assert(mock_dma_tx_active == 0);
    assert(huart.gState == HAL_UART_STATE_READY);

    huart = mock_handle(UART5);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL3,
                             GD32_DMA_REQUEST_USART0_TX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_NORMAL);
    __HAL_LINKDMA(&huart, hdmatx, hdmatx);
    assert(HAL_UART_Transmit_DMA(&huart, data, 4U) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_DMA_UNSUPPORTED);

