jyyy3901/GD32_HAL_Compat/Tests/test_uart_host.c
    huart = mock_handle(USART1);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL4,
                             GD32_DMA_REQUEST_USART0_RX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_NORMAL);
    __HAL_LINKDMA(&huart, hdmatx, hdmatx);
    assert(HAL_UART_Transmit_DMA(&huart, data, 4U) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_DMA_CONFIG_MISMATCH);

    hdmatx = mock_dma_handle(GD32_DMA0_CHANNEL3,
                             GD32_DMA_REQUEST_USART0_TX,
                             DMA_MEMORY_TO_PERIPH,
                             DMA_NORMAL);
    huart.hdmatx = &hdmatx;
    assert(HAL_UART_Transmit_DMA(&huart, data, 4U) == HAL_ERROR);
    assert(mock_last_port_error == GD32_HAL_PORT_ERROR_UART_DMA_LINK_INVALID);
}

static void test_deinit(void)
{
    UART_HandleTypeDef huart;

    mock_reset();
    huart = mock_handle(UART5);
    assert(HAL_UART_Init(&huart) == HAL_OK);
    assert(HAL_UART_DeInit(&huart) == HAL_OK);
    assert(mock_deinit_count == 1U);
    assert(mock_msp_deinit_count == 1U);
    assert(huart.gState == HAL_UART_STATE_RESET);
    assert(huart.RxState == HAL_UART_STATE_RESET);
}

int main(void)
{
    test_init_and_guards();
    test_polling();
    test_nine_bit_data_path();
    test_parity_data_mask();
    test_interrupt_transfers();
    test_interrupt_full_duplex();
    test_interrupt_error_mapping();
    test_interrupt_errors_and_abort();
    test_dma_normal_transfers();
    test_dma_circular_pause_resume_stop();
    test_dma_errors_abort_and_guards();
    test_deinit();
    puts("UART polling, interrupt and DMA host tests: PASS");
    return 0;
}
